app/Http/Controllers/AuthController.php

insert into `users` (`fname`, `lname`, `email`, `password`, `phone_no`, `address`, `updated_at`, `created_at`) values ('Maroco', 'Joseph', 'marojojo707@gmail.com', '$2y$10$1u6VJHUyc/xmZj/Gdq0iA.neiJwwqMyiUDcRBVJbzAqfvtrgh01AC', '75485673627', '8 Ain shams dawla', '2025-03-11 15:13:28', '2025-03-11 15:13:28')
---
      public function register(CreateUserRequest $request)
      {

        $data= $request->validated();
        $data["password"] = Hash::make($request->password);

          // Create the user
          $user = User::create($data);