app/Http/Controllers/BrandController.php

    public function index()
    {
        $this->setFilters();
        $data['filters'] = $this->filters;
        $data['rows'] = BrandResource::collection(Brand::paginate(20));
---
select * from `brands` limit 20 offset 0
select count(*) as aggregate from `brands`

    public function store(CreateBrandRequest $request)
    {

        $data = $request->validated();
        // return $data;
        $brand = Brand::create($data);
---
insert into `brands` (`name`, `updated_at`, `created_at`) values ('Christopher Velez', '2025-03-11 14:42:42', '2025-03-11 14:42:42')