app/Http/Controllers/BranchController.php

select * from `branches` limit 20 offset 0
select count(*) as aggregate from `branches`
---
    public function index()
    {

        $this->setFilters();
        $data['filters'] = $this->filters;
        $data['rows'] = BranchResource::collection(Branch::paginate(20));