app/Http/Controllers/CarController.php

select * from `cars` limit 20 offset 0
select count(*) as aggregate from `cars`
---
    public function index()
    {

        $this->setFilters();
        $data['filters'] = $this->filters;
        $data['rows'] = CarResource::collection(Car::paginate(20));

insert into `cars` (`model`, `year`, `price`, `color`, `doors`, `acceleration`, `top_speed`, `fuel_efficiency`, `engine_type`, `engine_power`, `engine_cylinder`, `engine_cubic_capacity_type`, `transmission`, `features`, `performance`, `safety`, `supplier_id`, `category_id`, `brand_id`, `branch_id`, `updated_at`, `created_at`) values ('Excepteur expedita e', '2018', '470', 'Quia quasi ut enim i', '61', '91', '34', '81', 'Earum assumenda et f', '92', '38', '73', 'Voluptates duis ut v', 'Ut labore ut pariatu', 'Quaerat consequuntur', 'Ipsum voluptates bla', '1', '1', '1', '1', '2025-03-11 14:44:11', '2025-03-11 14:44:11')
---
    public function store(Request $request)
    {

        $data = $request->all();
        // dd($data);
        $car = Car::create($data);

select * from `cars` where `cars`.`id` = '1' limit 1
update `cars` set `user_id` = '1', `is_sold` = 1, `cars`.`updated_at` = '2025-03-11 15:23:57' where `id` = 1
select * from `users` where `users`.`id` = '1' limit 1
---
    public function processSell(Request $request, $carId)
    {
        $car = Car::findOrFail($carId);

        // Validate the selected user
        $request->validate([
            'user_id' => 'required|exists:users,id',
        ]);

        // Assign the car to the new owner
        $car->user_id = $request->user_id;
        $car->is_sold = true; // Update status to sold
        $car->save();
        $id = $request->user_id;
        $userName = ModelsUser::find($id)->name;

select * from `users`
---
    public function getSellPage(Car $car){

        $users = ModelsUser::all();

select `name`, `id` from `branches`
select `name`, `id` from `brands`
select `type`, `id` from `categories`
select `lname`, `id` from `suppliers`
---
    private function getLookup()
    {
        return [
            "suppliers" => Supplier::pluck('lname', 'id'),
            "branches" => Branch::pluck('name', 'id'),
            "brands" => Brand::pluck('name', 'id'),
            "categories" => Category::pluck('type', 'id'),
        ];