app/Http/Controllers/CategoryController.php

    public function index()
    {
        $this->setFilters();
        $data['filters'] = $this->filters;
        $data['rows'] = CategoryResource::collection(Category::paginate(20));
---
select * from `categories` limit 20 offset 0
select count(*) as aggregate from `categories`