app/Http/Controllers/SupplierController.php

    public function index()
    {
        $this->setFilters();
        $data['filters'] = $this->filters;
        $data['rows'] = SupplierResource::collection(Supplier::paginate(20));
---
select * from `suppliers` limit 20 offset 0
select count(*) as aggregate from `suppliers`